import { ClauseList } from "./clauseList";
import { Header } from "./header";

const data = [
  {
    formTitle: "Асруулагчид хэрэгжүүлэх хөгжлийн төлөвлөгөөний жагсаалт",
    formNo: "Б-АС-1.1А",
    id: 23,
    lastUpdated: Date.now(),
    clauseList: [
      {
        clauseId: 87,
        clauseDescription:
          "Оршин суугчдад үзүүлэх нийгмийн халамжийн үйл ажиллагаа",
        clauseContent:
          "Энэ дэд салбарт оршин суугчдад үзүүлэх асаргаа, сувилгаа зэрэг бүх төрлийн нийгмийн халамжийн үйлчилгээ багтана. Энд эрүүл мэндийн болон нийгмийн үйлчилгээ хосолсон байх боловч зарим тохиолдолд асаргаа, сувилгааны үйлчилгээ голлох үүрэгтэй байна.",
      },
      {
        clauseId: 871,
        clauseDescription: "Асаргаа, сувилгааны үйл ажиллагаа",
        clauseContent: "8710-ыг харна уу.",
      },
      {
        clauseId: 8710,
        clauseDescription: "Асаргаа, сувилгааны үйл ажиллагаа",
        clauseContent: `Энэ ангид дараах үйл ажиллагаа орно:
        Ахмад настанд гэрээр үзүүлэх асаргаа, сувилгаа 
        Сувилал
        Амралт сувиллын газрын асаргаа, сувилгаа
        Асран хамгаалах газрууд 
        Асрамжийн газрын үйл ажиллагаа орно.
        Энэ ангид дараах үйл ажиллагаа орохгүй:
        Мэргэжлийн асрагч, сувилагчдын гэрээр үзүүлэх үйлчилгээ (дэд салбар 86-т)
        Ахмад настанд зориулсан асаргаа багатай болон асаргаагүй үйлчилгээ (8730-т)
        Орон гэргүй хүмүүсийг түр байрлуулах газар, хүүхэд асрах газар зэрэг хоноглох байртай нийгмийн үйлчилгээ (8790-т орно).`,
      },
      {
        clauseId: 872,
        clauseDescription:
          "Оюун ухааны хөгжлийн бэрхшээлтэй болон архи, мансууруулах бодист донтсон хүмүүст зориулсан төрөлжсөн асрамжийн үйл ажиллагаа",
        clauseContent: "8720-ыг харна уу.",
      },
      {
        clauseId: 8720,
        clauseDescription:
          "Оюун ухааны хөгжлийн бэрхшээлтэй болон архи, мансууруулах бодист донтсон хүмүүст зориулсан төрөлжсөн асрамжийн үйл ажиллагаа",
        clauseContent:
          "Энэ дэд салбарт оршин суугчдад үзүүлэх асаргаа, сувилгаа зэрэг бүх төрлийн нийгмийн халамжийн үйлчилгээ багтана. Энд эрүүл мэндийн болон нийгмийн үйлчилгээ хосолсон байх боловч зарим тохиолдолд асаргаа, сувилгааны үйлчилгээ голлох үүрэгтэй байна.",
      },
    ],
  },
];

const FormDetail: React.FC = () => {
  return (
    <div>
      <div className="custom-ant-card-padding-remove">
        <Header data={data} />
      </div>
      <ClauseList clauseList={data?.[0]?.clauseList} />
    </div>
  );
};

export default FormDetail;
